app/controllers/articles_controller.rb

  def index



     @articles = Article.order( :id ).page(params[:page]).per(5)
---
SELECT  "articles".* FROM "articles"   ORDER BY "articles"."id" ASC LIMIT 5 OFFSET 20
SELECT COUNT(*) FROM "articles"

  def edit

      @article = Article.find_by_id(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 12 LIMIT 1

  def update

    @article = Article.find_by_id(params[:id]).comments.first.update(content: "edited comment")
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 10 LIMIT 1
SELECT  "comments".* FROM "comments"  WHERE "comments"."article_id" = ?  ORDER BY "comments"."id" ASC LIMIT 1  [["article_id", 21]]
UPDATE "articles" SET "content" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 11  [["content", "Chelsea FC adalah klub berasal dari london INGGRIS\r\n"], ["title", "Chelseaa"], ["updated_at", "2015-11-26 09:21:05.225669"]]

   def create

     @article = Article.new(params_article)

    if @article.save
---
INSERT INTO "articles" ("content", "created_at", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "sda"], ["created_at", "2015-11-25 09:18:05.184348"], ["status", "f"], ["title", "asd"], ["updated_at", "2015-11-25 09:18:05.184348"]]

    def destroy
        Article.first.destroy
      @article =Article.find_by_id(params[:id])
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 12]]
SELECT  "articles".* FROM "articles"   ORDER BY "articles"."id" ASC LIMIT 1
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = 12 LIMIT 1