app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "comments" ("article_id", "content", "created_at", "status", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["content", "sadasda"], ["created_at", "2015-12-02 05:11:23.470451"], ["status", "asda"], ["updated_at", "2015-12-02 05:11:23.470451"]]
---
  def create

     @article = Article.find(params[:article_id])
    @comment =@article.comments.build(comment_params)

         respond_to do |format|

      if @comment.save