app/controllers/downloads_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 16]]
---
   def download
     p = Axlsx::Package.new
     @article=Article.find(params[:id])