app/controllers/imports_controller.rb

 def import

@spreadsheet = open_spreadsheet(params[:file])
        @article = Article.create(title: @spreadsheet.sheet('Article').row(2)[0], content:
@spreadsheet.sheet('Article').row(2)[1])

last_row = @spreadsheet.sheet('comment').last_row
(2..last_row).each do |index|
   @comment = @article.comments.build(content: @spreadsheet.sheet('comment').row(index)   [0])
@comment.save
---
INSERT INTO "articles" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Okey okey"], ["created_at", "2015-12-10 05:17:31.031097"], ["title", "Okey"], ["updated_at", "2015-12-10 05:17:31.031097"]]
INSERT INTO "comments" ("article_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 67], ["content", "siap"], ["created_at", "2015-12-11 07:24:02.803503"], ["updated_at", "2015-12-11 07:24:02.803503"]]